import { describe, expect, it } from 'vitest'
import { generateExcel, getServerSideProps, kk } from '../src/index'

describe('i18n-tool', () => {
  // it('readXlsx', async () => {
  //   expect(await readXlsx()).toMatchInlineSnapshot()
  // })

  it('getServerSideProps', async () => {
    expect(await getServerSideProps()).toMatchInlineSnapshot(`
      [
        {
          "list": [
            [
              "枪",
              "gun",
            ],
            [
              "中国",
              "China",
            ],
            [
              "同方",
              "Nuctech",
            ],
          ],
        },
      ]
    `)
  })

  it('generateExcel', async () => {
    expect(await generateExcel()).toMatchInlineSnapshot(`
      [
        {
          "zh_cn": "中文",
        },
        {
          "zh_cn": "0",
        },
        {
          "zh_cn": "1",
        },
        {
          "zh_cn": "2",
        },
        {
          "zh_cn": "3",
        },
        {
          "zh_cn": "4",
        },
        {
          "zh_cn": "5",
        },
        {
          "zh_cn": "6",
        },
        {
          "zh_cn": "7",
        },
        {
          "zh_cn": "8",
        },
        {
          "zh_cn": "9",
        },
        {
          "zh_cn": "关闭",
        },
        {
          "zh_cn": "F1",
        },
        {
          "zh_cn": "F2",
        },
        {
          "zh_cn": "详细信息",
        },
        {
          "zh_cn": "请输入当前密码",
        },
        {
          "zh_cn": "确定",
        },
        {
          "zh_cn": "取消",
        },
        {
          "zh_cn": "密码",
        },
        {
          "zh_cn": "保存",
        },
        {
          "zh_cn": "编辑",
        },
        {
          "zh_cn": "更多",
        },
        {
          "zh_cn": "复位",
        },
        {
          "zh_cn": "小时",
        },
        {
          "zh_cn": "{d}天{h}小时{m}分",
        },
        {
          "zh_cn": "毫米",
        },
        {
          "zh_cn": "秒",
        },
        {
          "zh_cn": "退出",
        },
        {
          "zh_cn": "询问",
        },
        {
          "zh_cn": "查询统计条件",
        },
        {
          "zh_cn": "描述",
        },
        {
          "zh_cn": "导出",
        },
        {
          "zh_cn": "打印",
        },
        {
          "zh_cn": "设备",
        },
        {
          "zh_cn": "站点",
        },
        {
          "zh_cn": "类型",
        },
        {
          "zh_cn": "查询",
        },
        {
          "zh_cn": "统计",
        },
        {
          "zh_cn": "开关机时间",
        },
        {
          "zh_cn": "关机时间",
        },
        {
          "zh_cn": "运行时间",
        },
        {
          "zh_cn": "本次登录",
        },
        {
          "zh_cn": "本日",
        },
        {
          "zh_cn": "本周",
        },
        {
          "zh_cn": "本月",
        },
        {
          "zh_cn": "本季度",
        },
        {
          "zh_cn": "本年",
        },
        {
          "zh_cn": "全部",
        },
        {
          "zh_cn": "成功",
        },
        {
          "zh_cn": "失败",
        },
        {
          "zh_cn": "结果",
        },
        {
          "zh_cn": "查询时段",
        },
        {
          "zh_cn": "时间",
        },
        {
          "zh_cn": "导出设置",
        },
        {
          "zh_cn": "放置",
        },
        {
          "zh_cn": "确认",
        },
        {
          "zh_cn": "出束",
        },
        {
          "zh_cn": "停束",
        },
        {
          "zh_cn": "运行",
        },
        {
          "zh_cn": "停止",
        },
        {
          "zh_cn": "启动",
        },
        {
          "zh_cn": "选择USB路径",
        },
        {
          "zh_cn": "转存方式",
        },
        {
          "zh_cn": "USB路径",
        },
        {
          "zh_cn": "导出格式",
        },
        {
          "zh_cn": "选择路径",
        },
        {
          "zh_cn": "新建文件夹",
        },
        {
          "zh_cn": "刷新",
        },
        {
          "zh_cn": "打开",
        },
        {
          "zh_cn": "闭合",
        },
        {
          "zh_cn": "清除错误",
        },
        {
          "zh_cn": "温度",
        },
        {
          "zh_cn": "运转",
        },
        {
          "zh_cn": "方向",
        },
        {
          "zh_cn": "速度",
        },
        {
          "zh_cn": "总工作时间",
        },
        {
          "zh_cn": "硬件",
        },
        {
          "zh_cn": "软件",
        },
        {
          "zh_cn": "版本号",
        },
        {
          "zh_cn": "通讯",
        },
        {
          "zh_cn": "状态",
        },
        {
          "zh_cn": "搜索",
        },
        {
          "zh_cn": "重置",
        },
        {
          "zh_cn": "展开",
        },
        {
          "zh_cn": "合并",
        },
        {
          "zh_cn": "未知",
        },
        {
          "zh_cn": "就绪",
        },
        {
          "zh_cn": "故障",
        },
        {
          "zh_cn": "导出设置",
        },
        {
          "zh_cn": "设备开机查询",
        },
        {
          "zh_cn": "出束",
        },
        {
          "zh_cn": "停束",
        },
        {
          "zh_cn": "皮带",
        },
        {
          "zh_cn": "光机",
        },
        {
          "zh_cn": "探测器",
        },
        {
          "zh_cn": "探测器诊断",
        },
        {
          "zh_cn": "显示设置",
        },
        {
          "zh_cn": "束面{number}",
        },
        {
          "zh_cn": "射线类型",
        },
        {
          "zh_cn": "诊断类型",
        },
        {
          "zh_cn": "高能",
        },
        {
          "zh_cn": "低能",
        },
        {
          "zh_cn": "原始数据",
        },
        {
          "zh_cn": "热力图",
        },
        {
          "zh_cn": "坏道诊断",
        },
        {
          "zh_cn": "保存原始数据",
        },
        {
          "zh_cn": "高能探测器坏道总个数",
        },
        {
          "zh_cn": "低能探测器坏道总个数",
        },
        {
          "zh_cn": "高能探测器连续坏道最大长度",
        },
        {
          "zh_cn": "低能探测器连续坏道最大长度",
        },
        {
          "zh_cn": "转动皮带",
        },
        {
          "zh_cn": "出束",
        },
        {
          "zh_cn": "开始采集",
        },
        {
          "zh_cn": "显示皮带增量",
        },
        {
          "zh_cn": "停止刷新",
        },
        {
          "zh_cn": "曲线截屏",
        },
        {
          "zh_cn": "写入坏道",
        },
        {
          "zh_cn": "恢复比例",
        },
        {
          "zh_cn": "清除故障",
        },
        {
          "zh_cn": "手动训管",
        },
        {
          "zh_cn": "X光机",
        },
        {
          "zh_cn": "电压",
        },
        {
          "zh_cn": "电流",
        },
        {
          "zh_cn": "错误码",
        },
        {
          "zh_cn": "就绪状态",
        },
        {
          "zh_cn": "停束状态",
        },
        {
          "zh_cn": "就绪",
        },
        {
          "zh_cn": "未就绪",
        },
        {
          "zh_cn": "未出束时间",
        },
        {
          "zh_cn": "训管",
        },
        {
          "zh_cn": "X光机详细信息",
        },
        {
          "zh_cn": "编号",
        },
        {
          "zh_cn": "出束时长",
        },
        {
          "zh_cn": "安装时间",
        },
        {
          "zh_cn": "备注",
        },
        {
          "zh_cn": "更换",
        },
        {
          "zh_cn": "型号",
        },
        {
          "zh_cn": "光机更换成功(出束时长置0)",
        },
        {
          "zh_cn": "光机更换失败",
        },
        {
          "zh_cn": "入口-[通]",
        },
        {
          "zh_cn": "出口-[通]",
        },
        {
          "zh_cn": "诊断报告",
        },
        {
          "zh_cn": "材料标定",
        },
        {
          "zh_cn": "性能检验",
        },
        {
          "zh_cn": "束面配准",
        },
        {
          "zh_cn": "OTK",
        },
        {
          "zh_cn": "光机剂量标定",
        },
        {
          "zh_cn": "几何标定",
        },
        {
          "zh_cn": "软件版本",
        },
        {
          "zh_cn": "同方威视CT型行李安全检查系统软件(OIS){v1} 算法版本{v2}",
        },
        {
          "zh_cn": "设备信息",
        },
        {
          "zh_cn": "设备型号:",
        },
        {
          "zh_cn": "设备名称:",
        },
        {
          "zh_cn": "设备编号:",
        },
        {
          "zh_cn": "设备位置:",
        },
        {
          "zh_cn": "设备标识:",
        },
        {
          "zh_cn": "唯一标识:",
        },
        {
          "zh_cn": "皮带额定速度(mm/s):",
        },
        {
          "zh_cn": "计时器和计数器信息",
        },
        {
          "zh_cn": "上电时间",
        },
        {
          "zh_cn": "硬盘存储空间",
        },
        {
          "zh_cn": "磁盘1: 总容量    {s1}G, 剩余    {s2}G",
        },
        {
          "zh_cn": "请输入厂家密码",
        },
        {
          "zh_cn": "CT type baggage safety inspection system software(OIS) version upgrade history",
        },
        {
          "zh_cn": "(OIS)Software external version number:",
        },
        {
          "zh_cn": "(OIS)Software build number:",
        },
        {
          "zh_cn": "Algorithm version number:",
        },
        {
          "zh_cn": "Installation time",
        },
        {
          "zh_cn": "Detailed information",
        },
        {
          "zh_cn": "设备启动次数",
        },
        {
          "zh_cn": "总上电计时",
        },
        {
          "zh_cn": "总扫描行李计数",
        },
        {
          "zh_cn": "总嫌疑行李计数",
        },
        {
          "zh_cn": "总出束计时",
        },
        {
          "zh_cn": "电动辊筒运行时间",
        },
        {
          "zh_cn": "CT{no}光机出束计时",
        },
        {
          "zh_cn": "登录计时:",
        },
        {
          "zh_cn": "是否需要注销",
        },
        {
          "zh_cn": "是否执行快速恢复操作",
        },
        {
          "zh_cn": "生成校正表",
        },
        {
          "zh_cn": "日志管理",
        },
        {
          "zh_cn": "维护",
        },
        {
          "zh_cn": "诊断",
        },
        {
          "zh_cn": "系统",
        },
        {
          "zh_cn": "CT探测器",
        },
        {
          "zh_cn": "控制板通讯",
        },
        {
          "zh_cn": "专用键盘",
        },
        {
          "zh_cn": "电动辊筒",
        },
        {
          "zh_cn": "光电传感器",
        },
        {
          "zh_cn": "自诊断",
        },
        {
          "zh_cn": "辐射检测",
        },
        {
          "zh_cn": "测试",
        },
        {
          "zh_cn": "标定",
        },
        {
          "zh_cn": "快速恢复",
        },
        {
          "zh_cn": "生成校正表前,必须清空通道",
        },
        {
          "zh_cn": "X射线发生器",
        },
        {
          "zh_cn": "注销",
        },
        {
          "zh_cn": "锁定",
        },
        {
          "zh_cn": "关于",
        },
      ]
    `)
  })

  it('kk', async () => {
    expect(await kk()).toMatchInlineSnapshot(`
      {
        "Props": {
          "Application": "SheetJS",
          "SheetNames": [
            "Sheet1",
          ],
          "Worksheets": 1,
        },
        "SSF": {
          "0": "General",
          "1": "0",
          "10": "0.00%",
          "11": "0.00E+00",
          "12": "# ?/?",
          "13": "# ??/??",
          "14": "m/d/yy",
          "15": "d-mmm-yy",
          "16": "d-mmm",
          "17": "mmm-yy",
          "18": "h:mm AM/PM",
          "19": "h:mm:ss AM/PM",
          "2": "0.00",
          "20": "h:mm",
          "21": "h:mm:ss",
          "22": "m/d/yy h:mm",
          "3": "#,##0",
          "37": "#,##0 ;(#,##0)",
          "38": "#,##0 ;[Red](#,##0)",
          "39": "#,##0.00;(#,##0.00)",
          "4": "#,##0.00",
          "40": "#,##0.00;[Red](#,##0.00)",
          "45": "mm:ss",
          "46": "[h]:mm:ss",
          "47": "mmss.0",
          "48": "##0.0E+0",
          "49": "@",
          "56": "\\"上午/下午 \\"hh\\"時\\"mm\\"分\\"ss\\"秒 \\"",
          "9": "0%",
        },
        "SheetNames": [
          "Sheet1",
        ],
        "Sheets": {
          "Sheet1": {
            "!ref": "A1:A199",
            "A1": {
              "t": "s",
              "v": "中文",
            },
            "A10": {
              "t": "s",
              "v": "8",
            },
            "A100": {
              "t": "s",
              "v": "诊断类型",
            },
            "A101": {
              "t": "s",
              "v": "高能",
            },
            "A102": {
              "t": "s",
              "v": "低能",
            },
            "A103": {
              "t": "s",
              "v": "原始数据",
            },
            "A104": {
              "t": "s",
              "v": "热力图",
            },
            "A105": {
              "t": "s",
              "v": "坏道诊断",
            },
            "A106": {
              "t": "s",
              "v": "保存原始数据",
            },
            "A107": {
              "t": "s",
              "v": "高能探测器坏道总个数",
            },
            "A108": {
              "t": "s",
              "v": "低能探测器坏道总个数",
            },
            "A109": {
              "t": "s",
              "v": "高能探测器连续坏道最大长度",
            },
            "A11": {
              "t": "s",
              "v": "9",
            },
            "A110": {
              "t": "s",
              "v": "低能探测器连续坏道最大长度",
            },
            "A111": {
              "t": "s",
              "v": "转动皮带",
            },
            "A112": {
              "t": "s",
              "v": "出束",
            },
            "A113": {
              "t": "s",
              "v": "开始采集",
            },
            "A114": {
              "t": "s",
              "v": "显示皮带增量",
            },
            "A115": {
              "t": "s",
              "v": "停止刷新",
            },
            "A116": {
              "t": "s",
              "v": "曲线截屏",
            },
            "A117": {
              "t": "s",
              "v": "写入坏道",
            },
            "A118": {
              "t": "s",
              "v": "恢复比例",
            },
            "A119": {
              "t": "s",
              "v": "清除故障",
            },
            "A12": {
              "t": "s",
              "v": "关闭",
            },
            "A120": {
              "t": "s",
              "v": "手动训管",
            },
            "A121": {
              "t": "s",
              "v": "X光机",
            },
            "A122": {
              "t": "s",
              "v": "电压",
            },
            "A123": {
              "t": "s",
              "v": "电流",
            },
            "A124": {
              "t": "s",
              "v": "错误码",
            },
            "A125": {
              "t": "s",
              "v": "就绪状态",
            },
            "A126": {
              "t": "s",
              "v": "停束状态",
            },
            "A127": {
              "t": "s",
              "v": "就绪",
            },
            "A128": {
              "t": "s",
              "v": "未就绪",
            },
            "A129": {
              "t": "s",
              "v": "未出束时间",
            },
            "A13": {
              "t": "s",
              "v": "F1",
            },
            "A130": {
              "t": "s",
              "v": "训管",
            },
            "A131": {
              "t": "s",
              "v": "X光机详细信息",
            },
            "A132": {
              "t": "s",
              "v": "编号",
            },
            "A133": {
              "t": "s",
              "v": "出束时长",
            },
            "A134": {
              "t": "s",
              "v": "安装时间",
            },
            "A135": {
              "t": "s",
              "v": "备注",
            },
            "A136": {
              "t": "s",
              "v": "更换",
            },
            "A137": {
              "t": "s",
              "v": "型号",
            },
            "A138": {
              "t": "s",
              "v": "光机更换成功(出束时长置0)",
            },
            "A139": {
              "t": "s",
              "v": "光机更换失败",
            },
            "A14": {
              "t": "s",
              "v": "F2",
            },
            "A140": {
              "t": "s",
              "v": "入口-[通]",
            },
            "A141": {
              "t": "s",
              "v": "出口-[通]",
            },
            "A142": {
              "t": "s",
              "v": "诊断报告",
            },
            "A143": {
              "t": "s",
              "v": "材料标定",
            },
            "A144": {
              "t": "s",
              "v": "性能检验",
            },
            "A145": {
              "t": "s",
              "v": "束面配准",
            },
            "A146": {
              "t": "s",
              "v": "OTK",
            },
            "A147": {
              "t": "s",
              "v": "光机剂量标定",
            },
            "A148": {
              "t": "s",
              "v": "几何标定",
            },
            "A149": {
              "t": "s",
              "v": "软件版本",
            },
            "A15": {
              "t": "s",
              "v": "详细信息",
            },
            "A150": {
              "t": "s",
              "v": "同方威视CT型行李安全检查系统软件(OIS){v1} 算法版本{v2}",
            },
            "A151": {
              "t": "s",
              "v": "设备信息",
            },
            "A152": {
              "t": "s",
              "v": "设备型号:",
            },
            "A153": {
              "t": "s",
              "v": "设备名称:",
            },
            "A154": {
              "t": "s",
              "v": "设备编号:",
            },
            "A155": {
              "t": "s",
              "v": "设备位置:",
            },
            "A156": {
              "t": "s",
              "v": "设备标识:",
            },
            "A157": {
              "t": "s",
              "v": "唯一标识:",
            },
            "A158": {
              "t": "s",
              "v": "皮带额定速度(mm/s):",
            },
            "A159": {
              "t": "s",
              "v": "计时器和计数器信息",
            },
            "A16": {
              "t": "s",
              "v": "请输入当前密码",
            },
            "A160": {
              "t": "s",
              "v": "上电时间",
            },
            "A161": {
              "t": "s",
              "v": "硬盘存储空间",
            },
            "A162": {
              "t": "s",
              "v": "磁盘1: 总容量    {s1}G, 剩余    {s2}G",
            },
            "A163": {
              "t": "s",
              "v": "请输入厂家密码",
            },
            "A164": {
              "t": "s",
              "v": "CT type baggage safety inspection system software(OIS) version upgrade history",
            },
            "A165": {
              "t": "s",
              "v": "(OIS)Software external version number:",
            },
            "A166": {
              "t": "s",
              "v": "(OIS)Software build number:",
            },
            "A167": {
              "t": "s",
              "v": "Algorithm version number:",
            },
            "A168": {
              "t": "s",
              "v": "Installation time",
            },
            "A169": {
              "t": "s",
              "v": "Detailed information",
            },
            "A17": {
              "t": "s",
              "v": "确定",
            },
            "A170": {
              "t": "s",
              "v": "设备启动次数",
            },
            "A171": {
              "t": "s",
              "v": "总上电计时",
            },
            "A172": {
              "t": "s",
              "v": "总扫描行李计数",
            },
            "A173": {
              "t": "s",
              "v": "总嫌疑行李计数",
            },
            "A174": {
              "t": "s",
              "v": "总出束计时",
            },
            "A175": {
              "t": "s",
              "v": "电动辊筒运行时间",
            },
            "A176": {
              "t": "s",
              "v": "CT{no}光机出束计时",
            },
            "A177": {
              "t": "s",
              "v": "登录计时:",
            },
            "A178": {
              "t": "s",
              "v": "是否需要注销",
            },
            "A179": {
              "t": "s",
              "v": "是否执行快速恢复操作",
            },
            "A18": {
              "t": "s",
              "v": "取消",
            },
            "A180": {
              "t": "s",
              "v": "生成校正表",
            },
            "A181": {
              "t": "s",
              "v": "日志管理",
            },
            "A182": {
              "t": "s",
              "v": "维护",
            },
            "A183": {
              "t": "s",
              "v": "诊断",
            },
            "A184": {
              "t": "s",
              "v": "系统",
            },
            "A185": {
              "t": "s",
              "v": "CT探测器",
            },
            "A186": {
              "t": "s",
              "v": "控制板通讯",
            },
            "A187": {
              "t": "s",
              "v": "专用键盘",
            },
            "A188": {
              "t": "s",
              "v": "电动辊筒",
            },
            "A189": {
              "t": "s",
              "v": "光电传感器",
            },
            "A19": {
              "t": "s",
              "v": "密码",
            },
            "A190": {
              "t": "s",
              "v": "自诊断",
            },
            "A191": {
              "t": "s",
              "v": "辐射检测",
            },
            "A192": {
              "t": "s",
              "v": "测试",
            },
            "A193": {
              "t": "s",
              "v": "标定",
            },
            "A194": {
              "t": "s",
              "v": "快速恢复",
            },
            "A195": {
              "t": "s",
              "v": "生成校正表前,必须清空通道",
            },
            "A196": {
              "t": "s",
              "v": "X射线发生器",
            },
            "A197": {
              "t": "s",
              "v": "注销",
            },
            "A198": {
              "t": "s",
              "v": "锁定",
            },
            "A199": {
              "t": "s",
              "v": "关于",
            },
            "A2": {
              "t": "s",
              "v": "0",
            },
            "A20": {
              "t": "s",
              "v": "保存",
            },
            "A21": {
              "t": "s",
              "v": "编辑",
            },
            "A22": {
              "t": "s",
              "v": "更多",
            },
            "A23": {
              "t": "s",
              "v": "复位",
            },
            "A24": {
              "t": "s",
              "v": "小时",
            },
            "A25": {
              "t": "s",
              "v": "{d}天{h}小时{m}分",
            },
            "A26": {
              "t": "s",
              "v": "毫米",
            },
            "A27": {
              "t": "s",
              "v": "秒",
            },
            "A28": {
              "t": "s",
              "v": "退出",
            },
            "A29": {
              "t": "s",
              "v": "询问",
            },
            "A3": {
              "t": "s",
              "v": "1",
            },
            "A30": {
              "t": "s",
              "v": "查询统计条件",
            },
            "A31": {
              "t": "s",
              "v": "描述",
            },
            "A32": {
              "t": "s",
              "v": "导出",
            },
            "A33": {
              "t": "s",
              "v": "打印",
            },
            "A34": {
              "t": "s",
              "v": "设备",
            },
            "A35": {
              "t": "s",
              "v": "站点",
            },
            "A36": {
              "t": "s",
              "v": "类型",
            },
            "A37": {
              "t": "s",
              "v": "查询",
            },
            "A38": {
              "t": "s",
              "v": "统计",
            },
            "A39": {
              "t": "s",
              "v": "开关机时间",
            },
            "A4": {
              "t": "s",
              "v": "2",
            },
            "A40": {
              "t": "s",
              "v": "关机时间",
            },
            "A41": {
              "t": "s",
              "v": "运行时间",
            },
            "A42": {
              "t": "s",
              "v": "本次登录",
            },
            "A43": {
              "t": "s",
              "v": "本日",
            },
            "A44": {
              "t": "s",
              "v": "本周",
            },
            "A45": {
              "t": "s",
              "v": "本月",
            },
            "A46": {
              "t": "s",
              "v": "本季度",
            },
            "A47": {
              "t": "s",
              "v": "本年",
            },
            "A48": {
              "t": "s",
              "v": "全部",
            },
            "A49": {
              "t": "s",
              "v": "成功",
            },
            "A5": {
              "t": "s",
              "v": "3",
            },
            "A50": {
              "t": "s",
              "v": "失败",
            },
            "A51": {
              "t": "s",
              "v": "结果",
            },
            "A52": {
              "t": "s",
              "v": "查询时段",
            },
            "A53": {
              "t": "s",
              "v": "时间",
            },
            "A54": {
              "t": "s",
              "v": "导出设置",
            },
            "A55": {
              "t": "s",
              "v": "放置",
            },
            "A56": {
              "t": "s",
              "v": "确认",
            },
            "A57": {
              "t": "s",
              "v": "出束",
            },
            "A58": {
              "t": "s",
              "v": "停束",
            },
            "A59": {
              "t": "s",
              "v": "运行",
            },
            "A6": {
              "t": "s",
              "v": "4",
            },
            "A60": {
              "t": "s",
              "v": "停止",
            },
            "A61": {
              "t": "s",
              "v": "启动",
            },
            "A62": {
              "t": "s",
              "v": "选择USB路径",
            },
            "A63": {
              "t": "s",
              "v": "转存方式",
            },
            "A64": {
              "t": "s",
              "v": "USB路径",
            },
            "A65": {
              "t": "s",
              "v": "导出格式",
            },
            "A66": {
              "t": "s",
              "v": "选择路径",
            },
            "A67": {
              "t": "s",
              "v": "新建文件夹",
            },
            "A68": {
              "t": "s",
              "v": "刷新",
            },
            "A69": {
              "t": "s",
              "v": "打开",
            },
            "A7": {
              "t": "s",
              "v": "5",
            },
            "A70": {
              "t": "s",
              "v": "闭合",
            },
            "A71": {
              "t": "s",
              "v": "清除错误",
            },
            "A72": {
              "t": "s",
              "v": "温度",
            },
            "A73": {
              "t": "s",
              "v": "运转",
            },
            "A74": {
              "t": "s",
              "v": "方向",
            },
            "A75": {
              "t": "s",
              "v": "速度",
            },
            "A76": {
              "t": "s",
              "v": "总工作时间",
            },
            "A77": {
              "t": "s",
              "v": "硬件",
            },
            "A78": {
              "t": "s",
              "v": "软件",
            },
            "A79": {
              "t": "s",
              "v": "版本号",
            },
            "A8": {
              "t": "s",
              "v": "6",
            },
            "A80": {
              "t": "s",
              "v": "通讯",
            },
            "A81": {
              "t": "s",
              "v": "状态",
            },
            "A82": {
              "t": "s",
              "v": "搜索",
            },
            "A83": {
              "t": "s",
              "v": "重置",
            },
            "A84": {
              "t": "s",
              "v": "展开",
            },
            "A85": {
              "t": "s",
              "v": "合并",
            },
            "A86": {
              "t": "s",
              "v": "未知",
            },
            "A87": {
              "t": "s",
              "v": "就绪",
            },
            "A88": {
              "t": "s",
              "v": "故障",
            },
            "A89": {
              "t": "s",
              "v": "导出设置",
            },
            "A9": {
              "t": "s",
              "v": "7",
            },
            "A90": {
              "t": "s",
              "v": "设备开机查询",
            },
            "A91": {
              "t": "s",
              "v": "出束",
            },
            "A92": {
              "t": "s",
              "v": "停束",
            },
            "A93": {
              "t": "s",
              "v": "皮带",
            },
            "A94": {
              "t": "s",
              "v": "光机",
            },
            "A95": {
              "t": "s",
              "v": "探测器",
            },
            "A96": {
              "t": "s",
              "v": "探测器诊断",
            },
            "A97": {
              "t": "s",
              "v": "显示设置",
            },
            "A98": {
              "t": "s",
              "v": "束面{number}",
            },
            "A99": {
              "t": "s",
              "v": "射线类型",
            },
          },
        },
      }
    `)
  })
})
